# Processamento de Dados em Python usando Pandas

## Pandas
- Um pacote muito poderoso de Python para a manipulação tabelas
- Construído em cima do numpy, é eficiente
- Poupa muito esforço de escrever código python de baixo nível para manipulação, extração e derivações de informações relacionadas às tabelas
- Fácil visualização com Matplotlib
- Principais estruturas de dados - `Series` e `DataFrame`

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## `Series`: array indexado

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
# Acesso aos dados
data[2]

0.75

## Índice explícito

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1], 
                 index=['a', 'b', 'c', 'd'])
#print(data)
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [5]:
# Acesso aos dados
data['b']

0.5

## Podemos utilizar tal como um dicionário

In [6]:
# Dicionário População de São Paulo
populacaoSP = {'São Paulo': 11914851, 
               'Guarulhos': 1361862,
               'Campinas': 1181555,
               'São Bernardo do Campo': 815109,
               'São José dos Campos': 716688}

In [7]:
populacaoSP['Campinas']

1181555

In [8]:
pop = pd.Series(populacaoSP)
print(pop)

São Paulo                11914851
Guarulhos                 1361862
Campinas                  1181555
São Bernardo do Campo      815109
São José dos Campos        716688
dtype: int64

In [9]:
idade = 18
print(f'A minha idade é {idade} anos')

A minha idade é 18 anos

In [10]:
pd.Series({'São Paulo': 11914851, 
           'Guarulhos': 1361862, 
           'Campinas': 1181555, 
           'São Bernardo do Campo': 815109, 
           'São José dos Campos': 716688})

São Paulo                11914851
Guarulhos                 1361862
Campinas                  1181555
São Bernardo do Campo      815109
São José dos Campos        716688
dtype: int64

## Acesso e fatiamento dos dados

In [11]:
# Acesso ao dado
pop['Campinas']

1181555

In [12]:
# Fatiamento dos dados
pop['São Bernardo do Campo':'São Paulo']

Series([], dtype: int64)

In [13]:
# Fatiamento dos dados
pop['São Paulo':'São Bernardo do Campo']

São Paulo                11914851
Guarulhos                 1361862
Campinas                  1181555
São Bernardo do Campo      815109
dtype: int64

## O objeto `DataFrame`

É um array bidimensional genérico com uma quantidade flexível de linhas e colunas

In [14]:
# Construção de um DataFrame a partir de um dicionário
d = {'col1': [1,2], 'col2': [3,4]}
df = pd.DataFrame(data=d, index=['a', 'b'])
df

   col1  col2
a     1     3
b     2     4

In [15]:
np.random.randint(low=0, high=10, size=(5,5))

array([[7, 1, 1, 9, 6],
       [4, 5, 1, 1, 4],
       [6, 9, 8, 4, 1],
       [4, 8, 3, 3, 7],
       [1, 9, 0, 4, 8]])

In [16]:
# Construção do DataFrame a partir de um numpy array
df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5,5)),
                  columns=['a','b','c','d','e'])
df2

   a  b  c  d  e
0  9  7  9  5  1
1  3  1  5  9  1
2  2  4  7  8  8
3  8  5  2  7  3
4  0  9  2  4  2

In [17]:
# Dicionário de áreas dos municípios
areaSP = {'São Paulo': 1521110, 
           'Guarulhos': 318675,
           'Campinas': 794571,
           'São Bernardo do Campo': 409532,
           'São José dos Campos': 1099409,
           'Itu': 999}
area = pd.Series(areaSP)
area

São Paulo                1521110
Guarulhos                 318675
Campinas                  794571
São Bernardo do Campo     409532
São José dos Campos      1099409
Itu                          999
dtype: int64

In [18]:
# Criação de um DataFrame
municipios = pd.DataFrame({'População': pop,
                           'Area': area})
municipios

                        População     Area
Campinas                1181555.0   794571
Guarulhos               1361862.0   318675
Itu                           NaN      999
São Bernardo do Campo    815109.0   409532
São José dos Campos      716688.0  1099409
São Paulo              11914851.0  1521110

In [19]:
#municipios['População']
densidade = municipios['População'] / municipios['Area']

municipios['densidade'] = densidade
municipios

                        População     Area  densidade
Campinas                1181555.0   794571   1.487035
Guarulhos               1361862.0   318675   4.273514
Itu                           NaN      999        NaN
São Bernardo do Campo    815109.0   409532   1.990343
São José dos Campos      716688.0  1099409   0.651885
São Paulo              11914851.0  1521110   7.832998

In [20]:
# Outro exemplo
datas = pd.date_range(start='2024-04-29', periods=6)
datas

DatetimeIndex(['2024-04-29', '2024-04-30', '2024-05-01', '2024-05-02',
               '2024-05-03', '2024-05-04'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df = pd.DataFrame(np.random.randn(6,4), index=datas, columns=['A','B','C','D'])
df

                   A         B         C         D
2024-04-29 -0.168160 -0.565237  1.167155 -0.065497
2024-04-30 -0.587345  0.340813 -0.484779  0.126839
2024-05-01  0.741808  0.731895  0.395799 -0.441426
2024-05-02  0.719509 -0.074094 -0.599280 -0.260872
2024-05-03  0.272983  1.123571  0.036322  0.910045
2024-05-04 -0.355904 -2.284629  1.665413 -2.040710

## Visualização dos Dados

In [22]:
datas = pd.date_range(start='2024-04-29', periods=1000)

df = pd.DataFrame(np.random.randn(1000,4), index=datas, 
                  columns=['A','B','C','D'])
df

                   A         B         C         D
2024-04-29  0.984348  0.498364 -0.346529  1.275283
2024-04-30  0.431154  0.464353  0.269679  0.749050
2024-05-01  0.869836  0.563484  0.128021  0.570672
2024-05-02 -0.466164  0.301073 -0.996330  0.590736
2024-05-03  1.960167 -0.528330  1.853066 -0.120482
...              ...       ...       ...       ...
2027-01-19 -0.099883 -1.152928 -0.449100 -1.783499
2027-01-20  1.337764  1.295224  0.487354  1.129909
2027-01-21  2.527033 -0.515169  0.066117 -0.141109
2027-01-22 -1.568258 -0.500075 -1.999791  1.116213
2027-01-23  1.018223 -0.307770 -0.764219  0.804379

[1000 rows x 4 columns]

In [23]:
df.head()

                   A         B         C         D
2024-04-29  0.984348  0.498364 -0.346529  1.275283
2024-04-30  0.431154  0.464353  0.269679  0.749050
2024-05-01  0.869836  0.563484  0.128021  0.570672
2024-05-02 -0.466164  0.301073 -0.996330  0.590736
2024-05-03  1.960167 -0.528330  1.853066 -0.120482

In [24]:
df.tail()

                   A         B         C         D
2027-01-19 -0.099883 -1.152928 -0.449100 -1.783499
2027-01-20  1.337764  1.295224  0.487354  1.129909
2027-01-21  2.527033 -0.515169  0.066117 -0.141109
2027-01-22 -1.568258 -0.500075 -1.999791  1.116213
2027-01-23  1.018223 -0.307770 -0.764219  0.804379

In [25]:
df.index

DatetimeIndex(['2024-04-29', '2024-04-30', '2024-05-01', '2024-05-02',
               '2024-05-03', '2024-05-04', '2024-05-05', '2024-05-06',
               '2024-05-07', '2024-05-08',
               ...
               '2027-01-14', '2027-01-15', '2027-01-16', '2027-01-17',
               '2027-01-18', '2027-01-19', '2027-01-20', '2027-01-21',
               '2027-01-22', '2027-01-23'],
              dtype='datetime64[ns]', length=1000, freq='D')

In [26]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [27]:
df.values

array([[ 0.98434805,  0.49836403, -0.34652881,  1.27528276],
       [ 0.43115383,  0.46435348,  0.26967935,  0.74904965],
       [ 0.86983563,  0.56348388,  0.1280206 ,  0.57067181],
       ...,
       [ 2.52703305, -0.51516858,  0.06611704, -0.14110908],
       [-1.56825818, -0.50007494, -1.99979061,  1.11621262],
       [ 1.01822288, -0.30777044, -0.76421947,  0.80437882]])

In [28]:
# Estatísticas rápidas
df.describe()

                 A            B            C            D
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.058956     0.017888    -0.035676     0.004023
std       0.984004     1.005267     1.001203     0.982923
min      -3.280374    -3.153217    -3.254734    -3.514855
25%      -0.708013    -0.648334    -0.714357    -0.670797
50%      -0.128334     0.019366    -0.047646     0.003760
75%       0.616637     0.698968     0.665527     0.682718
max       3.443922     3.458587     2.731930     3.018946

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1000 entries, 2024-04-29 to 2027-01-23
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       1000 non-null   float64
 1   B       1000 non-null   float64
 2   C       1000 non-null   float64
 3   D       1000 non-null   float64
dtypes: float64(4)
memory usage: 39.1 KB

In [30]:
# Ordenamento: ordenar pelo índice (linhas ou coluna) não valores da tabela
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2024-04-29  1.275283 -0.346529  0.498364  0.984348
2024-04-30  0.749050  0.269679  0.464353  0.431154
2024-05-01  0.570672  0.128021  0.563484  0.869836
2024-05-02  0.590736 -0.996330  0.301073 -0.466164
2024-05-03 -0.120482  1.853066 -0.528330  1.960167
...              ...       ...       ...       ...
2027-01-19 -1.783499 -0.449100 -1.152928 -0.099883
2027-01-20  1.129909  0.487354  1.295224  1.337764
2027-01-21 -0.141109  0.066117 -0.515169  2.527033
2027-01-22  1.116213 -1.999791 -0.500075 -1.568258
2027-01-23  0.804379 -0.764219 -0.307770  1.018223

[1000 rows x 4 columns]

In [31]:
df.sort_values(by='B')

                   A         B         C         D
2025-12-23 -2.229831 -3.153217  0.389361  0.550781
2026-05-21 -0.358114 -3.020372 -0.839290 -0.680865
2026-10-15 -0.619013 -2.896372  1.863897 -0.895061
2024-07-28  0.185192 -2.772061 -0.562067 -0.012560
2025-02-05 -0.308159 -2.743601  0.282102  0.570724
...              ...       ...       ...       ...
2026-12-21 -1.372792  2.587988 -0.407993  0.539855
2024-05-07  1.131431  2.611387  1.078156  1.332684
2026-05-15 -0.011457  2.847324  1.170250  0.851717
2026-12-05 -0.094823  2.849228 -0.398903  2.575331
2025-05-22  1.129988  3.458587 -0.922896  1.085478

[1000 rows x 4 columns]

## Selecionando dados

In [32]:
datas

DatetimeIndex(['2024-04-29', '2024-04-30', '2024-05-01', '2024-05-02',
               '2024-05-03', '2024-05-04', '2024-05-05', '2024-05-06',
               '2024-05-07', '2024-05-08',
               ...
               '2027-01-14', '2027-01-15', '2027-01-16', '2027-01-17',
               '2027-01-18', '2027-01-19', '2027-01-20', '2027-01-21',
               '2027-01-22', '2027-01-23'],
              dtype='datetime64[ns]', length=1000, freq='D')

In [33]:
df

                   A         B         C         D
2024-04-29  0.984348  0.498364 -0.346529  1.275283
2024-04-30  0.431154  0.464353  0.269679  0.749050
2024-05-01  0.869836  0.563484  0.128021  0.570672
2024-05-02 -0.466164  0.301073 -0.996330  0.590736
2024-05-03  1.960167 -0.528330  1.853066 -0.120482
...              ...       ...       ...       ...
2027-01-19 -0.099883 -1.152928 -0.449100 -1.783499
2027-01-20  1.337764  1.295224  0.487354  1.129909
2027-01-21  2.527033 -0.515169  0.066117 -0.141109
2027-01-22 -1.568258 -0.500075 -1.999791  1.116213
2027-01-23  1.018223 -0.307770 -0.764219  0.804379

[1000 rows x 4 columns]

In [34]:
# Seleção usando um rótulo
data = datas[0]
df.loc[data]

A    0.984348
B    0.498364
C   -0.346529
D    1.275283
Name: 2024-04-29 00:00:00, dtype: float64

In [35]:
df.loc[data,['A','C']]

A    0.984348
C   -0.346529
Name: 2024-04-29 00:00:00, dtype: float64

In [36]:
# Múltiplos eixos usando rótulo
df.loc[:,['A','C']]

                   A         C
2024-04-29  0.984348 -0.346529
2024-04-30  0.431154  0.269679
2024-05-01  0.869836  0.128021
2024-05-02 -0.466164 -0.996330
2024-05-03  1.960167  1.853066
...              ...       ...
2027-01-19 -0.099883 -0.449100
2027-01-20  1.337764  0.487354
2027-01-21  2.527033  0.066117
2027-01-22 -1.568258 -1.999791
2027-01-23  1.018223 -0.764219

[1000 rows x 2 columns]

In [37]:
df.head()

                   A         B         C         D
2024-04-29  0.984348  0.498364 -0.346529  1.275283
2024-04-30  0.431154  0.464353  0.269679  0.749050
2024-05-01  0.869836  0.563484  0.128021  0.570672
2024-05-02 -0.466164  0.301073 -0.996330  0.590736
2024-05-03  1.960167 -0.528330  1.853066 -0.120482

In [38]:
df.iloc[3]

A   -0.466164
B    0.301073
C   -0.996330
D    0.590736
Name: 2024-05-02 00:00:00, dtype: float64

In [39]:
df.iloc[3:5,0:2]

                   A         B
2024-05-02 -0.466164  0.301073
2024-05-03  1.960167 -0.528330

In [40]:
# Indexação Booleana
df[df>0]

                   A         B         C         D
2024-04-29  0.984348  0.498364       NaN  1.275283
2024-04-30  0.431154  0.464353  0.269679  0.749050
2024-05-01  0.869836  0.563484  0.128021  0.570672
2024-05-02       NaN  0.301073       NaN  0.590736
2024-05-03  1.960167       NaN  1.853066       NaN
...              ...       ...       ...       ...
2027-01-19       NaN       NaN       NaN       NaN
2027-01-20  1.337764  1.295224  0.487354  1.129909
2027-01-21  2.527033       NaN  0.066117       NaN
2027-01-22       NaN       NaN       NaN  1.116213
2027-01-23  1.018223       NaN       NaN  0.804379

[1000 rows x 4 columns]

In [41]:
datas = pd.date_range(start='2024-04-29', periods=6)

df = pd.DataFrame(np.random.randn(6,4), index=datas, 
                  columns=['A','B','C','D'])
df

                   A         B         C         D
2024-04-29 -0.339818 -0.902097 -0.343926 -0.356375
2024-04-30 -0.462658 -1.627417 -2.580178 -2.640334
2024-05-01 -0.627985 -0.401030 -1.278778 -0.698187
2024-05-02  0.716742 -0.508616  0.434094  0.116926
2024-05-03  0.076103  0.880213  0.633681  1.231861
2024-05-04 -0.147413 -0.692407  0.990252  1.199061

In [42]:
df2 = df.copy() # cuidado ao fazer df2 = df!

df2['E'] = ['um', 'um', 'dois', 'três', 'quatro', 'três']
df2

                   A         B         C         D       E
2024-04-29 -0.339818 -0.902097 -0.343926 -0.356375      um
2024-04-30 -0.462658 -1.627417 -2.580178 -2.640334      um
2024-05-01 -0.627985 -0.401030 -1.278778 -0.698187    dois
2024-05-02  0.716742 -0.508616  0.434094  0.116926    três
2024-05-03  0.076103  0.880213  0.633681  1.231861  quatro
2024-05-04 -0.147413 -0.692407  0.990252  1.199061    três

In [43]:
lista = ['banana', 'maça', 'uva', 'pitaia', 'framboesa', 
         'morango', 'limão', 'kiwi', 'grapefruit', 'laranja', 'abacaxi']

In [44]:
'banana' in lista

True

In [45]:
'açai' in lista

False

In [46]:
# Filtrando o meu dataset
df2[ df2['E'].isin(['dois','quatro']) ]

                   A         B         C         D       E
2024-05-01 -0.627985 -0.401030 -1.278778 -0.698187    dois
2024-05-03  0.076103  0.880213  0.633681  1.231861  quatro

In [47]:
aux = df2.groupby('E').mean()
aux.to_excel('tabela.xlsx')

### Aplicando funções no meu dataframe

In [48]:
df

                   A         B         C         D
2024-04-29 -0.339818 -0.902097 -0.343926 -0.356375
2024-04-30 -0.462658 -1.627417 -2.580178 -2.640334
2024-05-01 -0.627985 -0.401030 -1.278778 -0.698187
2024-05-02  0.716742 -0.508616  0.434094  0.116926
2024-05-03  0.076103  0.880213  0.633681  1.231861
2024-05-04 -0.147413 -0.692407  0.990252  1.199061

In [49]:
# Ao longo do eixo 0 (linhas), média das colunas
df.mean()

A   -0.130838
B   -0.541892
C   -0.357476
D   -0.191174
dtype: float64

In [50]:
# Ao longo do eixo 1 (colunas), média das linhas
df.mean(1)

2024-04-29   -0.485554
2024-04-30   -1.827647
2024-05-01   -0.751495
2024-05-02    0.189786
2024-05-03    0.705465
2024-05-04    0.337373
Freq: D, dtype: float64

In [51]:
df.apply( np.cumsum )

                   A         B         C         D
2024-04-29 -0.339818 -0.902097 -0.343926 -0.356375
2024-04-30 -0.802476 -2.529515 -2.924104 -2.996708
2024-05-01 -1.430461 -2.930545 -4.202882 -3.694895
2024-05-02 -0.713719 -3.439161 -3.768788 -3.577969
2024-05-03 -0.637616 -2.558948 -3.135107 -2.346108
2024-05-04 -0.785028 -3.251355 -2.144855 -1.147047

In [52]:
def fun(x):
    return x**2

In [53]:
df.apply( fun )

                   A         B         C         D
2024-04-29  0.115476  0.813780  0.118285  0.127003
2024-04-30  0.214053  2.648487  6.657319  6.971362
2024-05-01  0.394365  0.160825  1.635273  0.487464
2024-05-02  0.513719  0.258691  0.188437  0.013672
2024-05-03  0.005792  0.774775  0.401552  1.517482
2024-05-04  0.021730  0.479427  0.980598  1.437747

In [54]:
def maiusculas(x):
    return x.upper()

In [55]:
df2['E'] = df2['E'].apply(maiusculas) # persistir a mudança

In [56]:
df2

                   A         B         C         D       E
2024-04-29 -0.339818 -0.902097 -0.343926 -0.356375      UM
2024-04-30 -0.462658 -1.627417 -2.580178 -2.640334      UM
2024-05-01 -0.627985 -0.401030 -1.278778 -0.698187    DOIS
2024-05-02  0.716742 -0.508616  0.434094  0.116926    TRÊS
2024-05-03  0.076103  0.880213  0.633681  1.231861  QUATRO
2024-05-04 -0.147413 -0.692407  0.990252  1.199061    TRÊS

In [57]:
df.apply(lambda x: x**2)

                   A         B         C         D
2024-04-29  0.115476  0.813780  0.118285  0.127003
2024-04-30  0.214053  2.648487  6.657319  6.971362
2024-05-01  0.394365  0.160825  1.635273  0.487464
2024-05-02  0.513719  0.258691  0.188437  0.013672
2024-05-03  0.005792  0.774775  0.401552  1.517482
2024-05-04  0.021730  0.479427  0.980598  1.437747

## Juntando tabelas

In [58]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1,2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4,5]})

In [59]:
left

   key  lval
0  foo     1
1  bar     2

In [60]:
right

   key  rval
0  foo     4
1  bar     5

In [61]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [62]:
# Usando o comando Append
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.787048  0.443791  0.495120  0.031800
1  0.591158 -0.079015  0.014896  0.267014
2  0.374661  1.477454  0.439405 -1.959949
3  0.101331  1.286962 -0.928678  0.875755
4  1.223794  1.081461  0.177748 -0.067285
5 -1.257029  0.960595 -1.785683 -0.417636
6  0.658672  0.183093  0.741115  1.358181
7  0.592329 -1.607468 -1.217562  1.176799

In [63]:
# Usando o comando Append

### Agrupamento

In [64]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.695785  0.598563
1  bar    one -0.888085  0.813098
2  foo    two -0.749253  1.349214
3  bar  three -0.109429  0.711066
4  foo    two -0.791359 -1.931152
5  bar    two -0.102403  2.077594
6  foo    one  0.537927 -1.149391
7  foo  three -0.015076  0.992039

In [65]:
df['A'].unique()

array(['foo', 'bar'], dtype=object)

In [66]:
set(df['A'])

{'bar', 'foo'}

In [67]:
df.groupby('A').sum()

                     B         C         D
A
bar        onethreetwo -1.099918  3.601758
foo  onetwotwoonethree -1.713545 -0.140726

In [68]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.888085  0.813098
    three -0.109429  0.711066
    two   -0.102403  2.077594
foo one   -0.157858 -0.550828
    three -0.015076  0.992039
    two   -1.540611 -0.581938